import 'package:flutter/material.dart';
import 'package:get/get.dart';
import 'package:flutter_html/flutter_html.dart';
import 'package:html/dom.dart' as dom;
import 'package:maltaja/app/routes/app_pages.dart';

class JoinTerms extends StatelessWidget {
  final String terms =
      '제1장총칙제1조목적이약관은(주)피에이치피스쿨닷컴(이하“회사”라한다)이제공하는정보제공및구인,구직등의취업서비스피에치피스쿨(이하“서비스”라한다)의이용조건및절차에관한사항을규정함을목적으로합니다.제2조(정의)1.“피에이치피스쿨”이라함은웹프로그래밍언어php(PHP:Hypertext Preprocessor)를사용하는이용자들의php관련정보제공및구인,구직등의취업서비스를제공하는웹사이트를의미한다.2.“회원”이라함은서비스를이용하고자회사가요구하는정보를기재하고,이약관에동의한개인또는법인을의미합니다.3.“개인회원”이라함은서비스제공자가제공하는구직자서비스를이용하고자회원가입절차를완료하고회사의회원가입승인을취득한개인을말합니다.4.“기업회원”이라함은서비스제공자가제공하는기업서비스를이용하고자회원가입절차를완료하고회사의회원가입승인을취득한기업을말하며,가입서비스종류및기업의선택에따라회원이등급이변경될수있습니다.5.“이용자”라함은피에이치피스쿨(www.phpschool.com)에접속하여회사가제공하는서비스를받는회원또는비회원을의미합니다.6.“아이디(ID)”라함은회원의식별과서비스이용을위하여회원이정하고회사가승인하는문자와숫자의조합을의미합니다.7.“비밀번호(Password)”라함은회원이부여받은아이디와일치되는회원임을확인하고,회원이자신의비밀보호를위해정한문자또는숫자의조합을의미합니다.제3조약관의효력및변경1.이약관은서비스를통하여이를공지하거나전자우편,기타의방법으로이용자에게공지함으로써약관시행일로부터그효력이발생합니다.2.회사는이약관을변경할수있으며,약관을개정할경우에는적용일자및개정사유를명시하여현행약관과함께회사의서비스초기화면에적용일7일전부터적용일자전일까지게시하는방법으로그내용을공지합니다.3.이용자가변경된약관에동의하지아니하는경우에는서비스의이용을차단할수있으며,계속사용의경우에는본약관의변경내용에동의한것으로간주됩니다.제4조약관외준칙이약관에서정하지않은사항과이약관의해석에관하여는온라인디지털콘텐츠산업발전법,전자상거래등에서의소비자보호에관한법률,약관의규제에관한법률,기타관계법령의규정에따릅니다.제2장회원가입제5조(회원가입신청)1.회원가입은이용자의회원가입신청및이약관과회사의개인정보처리방침에대한동의의표시로써이루어집니다.2.회원가입은아이디(ID)단위로신청하는것을원칙으로하며,이용자는회원가입시실명인증및서비스의원활한운영을위하여회사가요청하는아래의필수입력사항들에대하여기재하여야합니다.그외의정보들은선택사항으로합니다.가.성명나.주민등록번호다.아이디(ID)라.비밀번호마.이메일(E-mail)바.전화번호3.회사는필요한경우위2항의내용이외에도새로운내용을추가할수있습니다.4.회사는이용자가회원가입시기재한모든정보가사실인것으로간주합니다.이에고의?과실여부와상관없이허위의정보를기재한이용자는법적인보호를받을수없을뿐아니라,회사의서비스제공을제한받으실수있습니다.제6조(회원가입신청에대한승낙및거부)1.회사는제5조의회원가입신청에대하여특별한사정이없는한접수순서에따라이를승낙합니다.2.회사는다음각호에해당하는경우회원가입신청에대한승낙을제한할수있고,그사유가해소될때까지승낙을유보할수있습니다.가.서비스관련설비의용량이부족한경우나.기술상장애사유가있는경우다.가입신청자가본약관제8조2항에의거하여이전에회원자격을상실한적이있는경우라.등록내용에허위,기재누락,오기가있는경우마.기타회사가필요하다고인정되는경우3.만14세미만의미성년자는반드시법정대리인(부모)의가입동의를받아야정상적인서비스이용이가능하며,법정대리인의가입동의의사표시는이메일(E-mail),팩스,전화,우편등의방법을이용할수있습니다.4.만20세미만의미성년자는유료콘텐츠이용전에반드시법정대리인(부모)의유료콘텐츠이용에관한동의를받아야정상적인콘텐츠의구매가가능하며,법정대리인의유료콘텐츠이용에관한동의의사표시는이메일(E-mail),팩스(02-2026-5314),전화,우편등의방법을이용할수있습니다.제7조(회원정보의변경)회원은언제든지서비스를이용하여자신의가입정보들을변경할수있습니다.제8조(회원탈퇴및자격상실)1.회원은회사에언제든지탈퇴를요청할수있으며,회원의탈퇴요청이있을시에회사는즉시해당회원을탈퇴처리합니다.2.회사는다음각호에해당하는경우회원의자격을제한및삭제할수있습니다.가.회원가입신청시허위의정보를기재한경우나.설비에여유가없거나기술상지장이있는경우다.기타회사가필요하다고인정되는경우제9조(회원에대한통지)1.회사는서비스초기화면에대한공지,회원이가입신청당시기재한이메일주소,전화번호등을이용한방법으로회원에통지할수있습니다.2.회사는불특정다수에대한통지의경우서비스초기화면에1주일간해당내용을기재함으로써,개별통지에갈음할수있습니다.제3장서비스종류및이용제10조(서비스종류및변경)1.회사가제공하는서비스의종류는아래와같습니다.가.php관련정보의제공나.회원간의커뮤니케이션창구제공(글쓰기,수정,검색,삭제,쪽지보내기등)다.이력서작성/저장/수정/인재DB에이력서등록라.온라인입사지원마.기업의스카우트제의서비스(단,이력서를공개로설정한경우에가능함)바.맞춤채용정보검색/등록사.구인정보스크랩아.마감된구인정보검색자.기타"서비스제공자"가자체개발하거나다른회사와의협력계약등을통해"회원"들에게제공할일체의서비스2.회사가제공하는서비스의종류는회사의경영정책상변경할수있으며,변경된내용은제9조의방법으로공지합니다.제11조(서비스이용)1.서비스이용은회사가회원의가입신청을승낙한때로부터즉시가능해집니다.단,제13조에한하여그시점이연기될수있습니다.2.서비스의이용시간은회사의업무상또는기술상장애,기타특별한사유가없는한연중무휴,1일24시간이용할수있습니다.단,제13조에한하여이용을제한할수있습니다.제12조(서비스이용요금)1.회사의서비스는유료와무료로구분이가능하며,유료서비스의경우해당요금의세부내역은서비스내에별도명기합니다.2.서비스이용요금은회사의정책에의하여변경될수있습니다.제13조(서비스제공의중지)회사는아래각호에해당하는경우서비스의일부혹은전부의제공을중지할수있습니다.가.서비스용설비의보수등공사로인한부득이한경우나.전기통신사업법에규정된기간통신사업자가전기통신서비스를중지했을경우다.국가비상사태,정전,서비스설비의장애또는서비스이용의폭주등으로정상적인서비스이용에지장이있는때라.네트워크상의위험성에기초한타인의서비스제공음해행위가있는때제4장개인정보보호및저작권제14조(이용자의개인정보보호)1.회사는서비스이용자의정보수집시반드시당해이용자의동의를얻어필요한최소한의정보만을수집하며,이용자는온라인을통해서수시로본인의신상정보를열람,정정또는삭제할수있습니다.2.회사는이용자의개인신상정보를본인의동의없이는절대제3자에게제공,분실또는유출하여서는안되며이를지키지않아서발생하는이용자의모든피해에대한책임은회사에있습니다.단,다음과같은경우에는예외로합니다.가.전기통신기본법등관계법령에의하여국가기관등의요구가있는경우나.범죄에대한수사상의목적이있거나정보통신윤리위원회의요청이있는경우다.배송업무상배송업체에고객의정보를알려주는경우라.은행업무상관련사항에한하여일부정보를공유하는경우마.특정인을식별할수없는통계작성,홍보자료,학술연구등의목적인경우바.이용자의동의없이개인정보가유출되는등부당한사례를발견했을때에는전화02-2627-6637,이메일(E-mail):desk@phpschool.com,한국소비자보호원,경실련등을통해신고할수있으며,이에대해회사는적절한조치를취할의무가있습니다3.“회사”는"서비스"에등록된회원의ID와이력서정보(이름,주소,연락처등모두포함)를관리합니다.4.“회사”는회원이이력서입력시비공개로설정한경우에는절대외부로노출하지않습니다.제15조(회사의의무)1."회사"는법령과본약관이금지하거나공서양속에반하는행위를하지않으며본약관이정하는바에따라지속적이고,안정적으로서비스를제공하기위해서노력합니다.2.."회사"는"회원"이안전하게서비스를이용할수있도록"회원"의개인정보(신용정보포함)보호를위한보안시스템을구축합니다.3."회사"는"회원"이원하지않는영리목적의광고성전자우편을발송하지않습니다.제16조(저작권의귀속및이용제한)1.회사가작성한저작물에대한저작재산권은회사에있습니다.2.이용자는서비스를이용함에있어취득한정보를회사의사전승낙없이제3자에게제공하거나,복제,출판등의방법으로배포할수없습니다.제5장손해배상및면책조항제17조(손해배상)1.회사는무료인서비스와정보서비스이용과관련하여이용자에게발생한어떠한손해도책임지지않습니다.2.회사는유료인서비스의이용과관련하여발생하는이용자의손해에대하여관계법령이정하는한도내에서배상책임을집니다.단,이용자의과실이있는경우에는해당부분에대한책임이면제됩니다.제18조(연결서비스와피연결서비스간의관계)1.상위서비스와하위서비스가링크(예:링크의대상에는문자및그림등이포함됨)방식등으로연결된경우,전자를연결서비스(웹사이트)이라고하고후자를피연결서비스(웹사이트)라고합니다.2.연결서비스는피연결서비스가독자적으로제공하는재화?용역에의하여발생된이용자와의거래에대해서보증책임을지지않습니다제19조(면책)1.회사는본약관에서달리정한것을제외하고는각쇼핑몰에게재된어떠한상품이나정보에대하여도권한과책임을가지지않습니다.2.쇼핑몰고객은각쇼핑몰에게재된상품정보를스스로의판단하에서자유롭게이용할권리가있습니다.또한,회사는어떠한경우라도쇼핑몰고객이쇼핑몰에게재된상품정보에의해입은손해에대해책임이없습니다.3.관리자가회사와제휴된외부서비스를이용하는중,외부서비스제공사의일방적인정책변경에따라발생하는관리자의손해는서비스제공사에게책임이있으며,이에대해회사는면책됩니다.제6장기타사항제20조(개인정보위탁처리)①회사는업무진행에있어필요에의하여고객정보처리를외부기관에위탁처리하고있습니다.②회사는수탁업체에게고객의민원사항처리를위해필요한범위내에서정보를제공할수있으며,회사의개인정보보호정책을준수할수있는자를수탁자로선정합니다.③회사는위탁계약서상의회사의개인정보보호관련지시엄수,개인정보에관한비밀유지,제3자제공의금지,사고시의책임및손해배상등에대한사항을명확히규정하고당해계약내용을서면또는전자적기록으로보존하여야합니다.제21조(권리의양도금지)관리자는회사의서면동의없이본약관상의권리와의무를제3자에게양도,증여하거나이를담보로제공할수없습니다.제22조(기타사항)①이약관에규정되어있지아니한사항은관계법령및일반적인상관례에따릅니다.②이약관으로발생한분쟁에대하여소송이제기될경우서울중앙지방법원을관할법원으로합니다.*부칙이약관은2010년2월1일부터시행합니다.';

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text(
          '이용약관',
          style: TextStyle(
            color: Colors.black,
          ),
        ),
        actions: <Widget>[
          GestureDetector(
            onTap: () {
              showDialog(
                  context: context,
                  builder: (BuildContext context) => AlertDialog(
                        title: Text('이용약관 동의'),
                        content: Text('약관에 동의하십니까?'),
                        actions: <Widget>[
                          TextButton(
                            onPressed: () {
                              Navigator.pop(context, 'cancel');
                            },
                            child: Text('취소'),
                          ),
                          TextButton(
                            onPressed: () {
                              Get.toNamed(Routes.JOIN);
                            },
                            child: Text('동의'),
                          ),
                        ],
                      ));
            },
            child: Container(
              alignment: Alignment.center,
              margin: EdgeInsets.only(right: 10.0),
              child: Text(
                '동의',
                style: TextStyle(
                  fontSize: 16.0,
                  fontWeight: FontWeight.bold,
                  color: Colors.black,
                ),
              ),
            ),
          ),
        ],
      ),
      body: SingleChildScrollView(
        child: Container(
          padding: EdgeInsets.all(12.0),
          child: Html(data: "$terms"),
        ),
      ),
    );
  }
}
